# pandas Basics

- In this homework assignment, you will practice selecting, sorting, and aggregating data in a DataFrame. 
- Follow each *TODO* instruction to write a Python code snippet with pandas and Numpy. Include the output of each code cell.

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

**TODO 1**
Consider the following Python dictionary `adict`. 

```python
adict = {'state': ['New York', 'California', 'Maryland'], 
         'pop2010': [19378, 37254, 5774],
         'pop2018': [19542, 39557, 6043],
         'rev2010': [71545, 112372, 17064],
         'rev2018': [88541, 175017, 22427]}
```

Notation:

- `pop2010`: state's 2010 population (in thousand)
- `pop2018`: state's 2018 population (in thousand)
- `rev2010`: state's 2010 tax revenue (in million USD)
- `rev2018`: state's 2018 tax revenue (in million USD)

Construct a DataFrame `frame` from dictionary `adict`. The row label (index) of each state is its abbreviation, i.e., `NY`, `CA` or `MD`.

In [133]:
adict = {'state': ['New York', 'California', 'Maryland'], 
         'pop2010': [19378, 37254, 5774],
         'pop2018': [19542, 39557, 6043],
         'rev2010': [71545, 112372, 17064],
         'rev2018': [88541, 175017, 22427]}
states=["NY","CA","MD"]
frame = pd.DataFrame(adict,index=states)
frame

         state  pop2010  pop2018  rev2010  rev2018
NY    New York    19378    19542    71545    88541
CA  California    37254    39557   112372   175017
MD    Maryland     5774     6043    17064    22427

**TODO 2**
It is known that the areas of the three states are 54555, 163695 and 12406 square miles. Add a column `area` with appropriate data to DataFrame `frame`.

In [134]:
frame["area"] = [54555,163695,12406]
frame

         state  pop2010  pop2018  rev2010  rev2018    area
NY    New York    19378    19542    71545    88541   54555
CA  California    37254    39557   112372   175017  163695
MD    Maryland     5774     6043    17064    22427   12406

**TODO 3** 
Select the first row and the last row of DataFrame `frame`.

In [135]:
frame[0:3:2]

       state  pop2010  pop2018  rev2010  rev2018   area
NY  New York    19378    19542    71545    88541  54555
MD  Maryland     5774     6043    17064    22427  12406

**TODO 4**
Select just columns `state`, `pop2018` and `area` from DataFrame `frame`.

In [136]:
frame[['state','pop2018','area']]

         state  pop2018    area
NY    New York    19542   54555
CA  California    39557  163695
MD    Maryland     6043   12406

**TODO 5**
Select the New York state's population data in 2010 and 2018.

In [137]:
frame.loc['NY',['pop2010','pop2018']]

pop2010    19378
pop2018    19542
Name: NY, dtype: object

**TODO 6**
Show the row labels of the second row and the third row.

In [138]:
frame.state[1:3]

CA    California
MD      Maryland
Name: state, dtype: object

**TODO 7**
Select just columns `state`, `rev2010` and `rev2018` of the second row and the third row from DataFrame `frame`.

In [139]:
frame.loc[['CA','MD'],['state','rev2010','rev2018']]

         state  rev2010  rev2018
CA  California   112372   175017
MD    Maryland    17064    22427

**TODO 8** Select only the rows from DataFrame `frame` with an area greater than 50,000.

In [140]:
frame.loc[frame.area>50000]

         state  pop2010  pop2018  rev2010  rev2018    area
NY    New York    19378    19542    71545    88541   54555
CA  California    37254    39557   112372   175017  163695

**TODO 9** 
Add a column `popchange` to DataFrame `frame`. Assign the percentage change from 2010 to 2018 in each state's population to this new column.

In [141]:
frame['popchange']=frame.pop2018/frame.pop2010
frame

         state  pop2010  pop2018  rev2010  rev2018    area  popchange
NY    New York    19378    19542    71545    88541   54555   1.008463
CA  California    37254    39557   112372   175017  163695   1.061819
MD    Maryland     5774     6043    17064    22427   12406   1.046588

**TODO 10** 
Sort DataFrame `frame` by the index.

In [142]:
frame.sort_values(by='state',ascending=True)

         state  pop2010  pop2018  rev2010  rev2018    area  popchange
CA  California    37254    39557   112372   175017  163695   1.061819
MD    Maryland     5774     6043    17064    22427   12406   1.046588
NY    New York    19378    19542    71545    88541   54555   1.008463

**TODO 11**
Sort DataFrame `frame` by the 2018 population in descending order.

In [143]:
frame.sort_values(by='pop2018',ascending=False)

         state  pop2010  pop2018  rev2010  rev2018    area  popchange
CA  California    37254    39557   112372   175017  163695   1.061819
NY    New York    19378    19542    71545    88541   54555   1.008463
MD    Maryland     5774     6043    17064    22427   12406   1.046588

**TODO 12**
Compute the total tax revenue across the three states in DataFrame `frame`.

In [144]:
sum(frame['rev2010']+frame['rev2018'])

486966

In [145]:
#Check:
112372+175017+71545+88541+17064+22427

486966

**TODO 13** In how many states did the tax reveue increase by at least 30%?

In [146]:
frame.loc[(frame.rev2018/frame.rev2010)>1.3]

         state  pop2010  pop2018  rev2010  rev2018    area  popchange
CA  California    37254    39557   112372   175017  163695   1.061819
MD    Maryland     5774     6043    17064    22427   12406   1.046588

**TODO 14** 
Return the index of the row with the highest `popchange` value.

In [147]:
frame[['popchange']].idxmax()

popchange    CA
dtype: object

**TODO 15**
Replace Maryland's `popchange` value by `np.NaN`. Then count the number of rows in the DataFrame with one or more missing values.

Hint: use methods `isnull()` and `any(axis = 1)`.

In [180]:
frame.loc['MD',['popchange']] = np.NaN
frame

         state  pop2010  pop2018  rev2010  rev2018    area  popchange
NY    New York    19378    19542    71545    88541   54555   1.008463
CA  California    37254    39557   112372   175017  163695   1.061819
MD    Maryland     5774     6043    17064    22427   12406        NaN

In [188]:
frame.isnull().any(axis=1)

NY    False
CA    False
MD     True
dtype: bool